biletbank-updatepassengers/BILETBANK API REQUEST&RESPONSE - V2 BrandedFareItemId - RT RecommendationBox/Makepayment req

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:trev="http://schemas.datacontract.org/2004/07/Trevoo.WS.Entities.Base" xmlns:trev1="http://schemas.datacontract.org/2004/07/Trevoo.WS.IO.Shopping">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:MakePayment_FromRunningAccount>
         <!--Optional:-->
         <tem:request>
            <!--Optional:-->
            <trev:AuthenticationHeader>
               <!--Optional:-->
               <trev:SessionId>7434204</trev:SessionId>
               <trev:SessionToken>db14f99c-897e-4c51-8599-115813e40836</trev:SessionToken>
            </trev:AuthenticationHeader>
            <!--Optional:-->
            <trev:ExtraParamList>
               <!--Zero or more repetitions:-->
               <trev:ExtendedData>
                  <!--Optional:-->
               </trev:ExtendedData>
            </trev:ExtraParamList>
            <!--Optional:-->
            <trev1:DeductLastSellerCommission>false</trev1:DeductLastSellerCommission>
            <!--Optional:-->
            <trev1:PaymentForm>
               <!--Optional:-->
               <trev1:Amount>15195.99</trev1:Amount>
               <!--Optional:-->
               <trev1:Currency>TRY</trev1:Currency>
               <!--Optional:-->
               <trev1:IsPartialPayment>false</trev1:IsPartialPayment>
               <!--Optional:-->
               <trev1:PaymentType>RA_BALANCE_PAYMENT</trev1:PaymentType>
               <!--Optional:-->
               <trev1:ShoppingFileId>87264cf8-dcf1-4a4d-b303-05ab97ff26b7</trev1:ShoppingFileId>
            </trev1:PaymentForm>
         </tem:request>
      </tem:MakePayment_FromRunningAccount>
   </soapenv:Body>
</soapenv:Envelope>